doom.org
#+title: Sebastian Hempel Linde's Doom Emacs Configuration
#+author: Sebastian Hempel Linde
#+startup: overview

* Structure
** ~init.el~

#+begin_src emacs-lisp :tangle "init.el" :noweb tangle
<<init-header>>

(doom! :input
       <<input-modules>>

       :completion
       <<completion-modules>>

       :ui
       <<ui-modules>>

       :editor
       <<editor-modules>>

       :emacs
       <<emacs-modules>>

       :term
       <<term-modules>>

       :tools
       <<tools-modules>>

       :os
       <<os-modules>>

       :lang
       <<lang-modules>>

       :email
       <<email-modules>>

       :app
       <<app-modules>>

       :config
       <<config-modules>>)
#+end_src

** ~packages.el~

#+begin_src emacs-lisp :tangle "packages.el" :noweb tangle
<<packages-header>>

;;; Input Packages
<<input-packages>>

;;; Completion Packages
<<completion-packages>>

;;; UI Packages
<<ui-packages>>

;;; Editor Packages
<<editor-packages>>

;;; Emacs Packages
<<emacs-packages>>

;;; Term Packages
<<term-packages>>

;;; Tools Packages
<<tools-packages>>

;;; OS Packages
<<os-packages>>

;;; Language Packages
<<lang-packages>>

;;; Email Packages
<<email-packages>>

;;; App Packages
<<app-packages>>

;;; Config Packages
<<config-packages>>
#+end_src

** ~config.el~

#+begin_src emacs-lisp :tangle "config.el" :noweb tangle
<<config-header>>

;;; Better Defaults
<<general-config>>

;;; Input Config
<<input-config>>

;;; Completion Config
<<completion-config>>

;;; UI Config
<<ui-config>>

;;; Editor Config
<<editor-config>>

;;; Emacs Config
<<emacs-config>>

;;; Term Config
<<term-config>>

;;; Tools Config
<<tools-config>>

;;; OS Config
<<os-config>>

;;; Language Config
<<lang-config>>

;;; Email Config
<<email-config>>

;;; App Config
<<app-config>>

;;; Config Config
<<config-config>>
#+end_src

* Config File Headers
** ~init.el~

#+NAME: init-header
#+begin_src emacs-lisp
;;; init.el -*- lexical-binding: t; -*-

;; DO NOT EDIT THIS FILE DIRECTLY
;; This is a file generated from a literate programing source file located at
;; https://github.com/shlinde/doom/-/blob/master/doom.org
;; You should make any changes there and regenerate it from Emacs org-mode
;; using org-babel-tangle (C-c C-v t)

;; This file controls what Doom modules are enabled and what order they load
;; in. Remember to run 'doom sync' after modifying it!

;; NOTE Press 'SPC h d h' (or 'C-h d h' for non-vim users) to access Doom's
;;      documentation. There you'll find a "Module Index" link where you'll find
;;      a comprehensive list of Doom's modules and what flags they support.

;; NOTE Move your cursor over a module's name (or its flags) and press 'K' (or
;;      'C-c c k' for non-vim users) to view its documentation. This works on
;;      flags as well (those symbols that start with a plus).
;;
;;      Alternatively, press 'gd' (or 'C-c c d') on a module to browse its
;;      directory (for easy access to its source code).

#+end_src

** ~packages.el~

#+NAME: packages-header
#+begin_src emacs-lisp
;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

;; DO NOT EDIT THIS FILE DIRECTLY
;; This is a file generated from a literate programing source file located at
;; https://github.com/shlinde/doom/-/blob/master/doom.org
;; You should make any changes there and regenerate it from Emacs org-mode
;; using org-babel-tangle (C-c C-v t)

;; To install a package with Doom you must declare them here and run 'doom sync'
;; on the command line, then restart Emacs for the changes to take effect -- or
;; use 'M-x doom/reload'.

;; To install SOME-PACKAGE from MELPA, ELPA or emacsmirror:
;;(package! some-package)

;; To install a package directly from a remote git repo, you must specify a
;; `:recipe'. You'll find documentation on what `:recipe' accepts here:
;; https://github.com/raxod502/straight.el#the-recipe-format
;;(package! another-package
;;  :recipe (:host github :repo "username/repo"))

;; If the package you are trying to install does not contain a PACKAGENAME.el
;; file, or is located in a subdirectory of the repo, you'll need to specify
;; `:files' in the `:recipe':
;;(package! this-package
;;  :recipe (:host github :repo "username/repo"
;;           :files ("some-file.el" "src/lisp/*.el")))

;; If you'd like to disable a package included with Doom, you can do so here
;; with the `:disable' property:
;;(package! builtin-package :disable t)

;; You can override the recipe of a built in package without having to specify
;; all the properties for `:recipe'. These will inherit the rest of its recipe
;; from Doom or MELPA/ELPA/Emacsmirror:
;;(package! builtin-package :recipe (:nonrecursive t))
;;(package! builtin-package-2 :recipe (:repo "myfork/package"))

;; Specify a `:branch' to install a package from a particular branch or tag.
;; This is required for some packages whose default branch isn't 'master' (which
;; our package manager can't deal with; see raxod502/straight.el#279)
;;(package! builtin-package :recipe (:branch "develop"))

;; Use `:pin' to specify a particular commit to install.
;;(package! builtin-package :pin "1a2b3c4d5e")

;; Doom's packages are pinned to a specific commit and updated from release to
;; release. The `unpin!' macro allows you to unpin single packages...
;;(unpin! pinned-package)
;; ...or multiple packages
;;(unpin! pinned-package another-pinned-package)
;; ...Or *all* packages (NOT RECOMMENDED; will likely break things)
;;(unpin! t)
#+end_src

** ~config.el~

#+NAME: config-header
#+begin_src emacs-lisp
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

;; DO NOT EDIT THIS FILE DIRECTLY
;; This is a file generated from a literate programing source file located at
;; https://github.com/shlinde/doom/-/blob/master/doom.org
;; You should make any changes there and regenerate it from Emacs org-mode
;; using org-babel-tangle (C-c C-v t)

;; Place your private configuration here! Remember, you do not need to run 'doom
;; sync' after modifying this file!

;; Some functionality uses this to identify you, e.g. GPG configuration, email
;; clients, file templates and snippets.
;; (setq user-full-name "John Doe"
;;      user-mail-address "john@doe.com")

;; Doom exposes five (optional) variables for controlling fonts in Doom. Here
;; are the three important ones:
;;
;; + `doom-font'
;; + `doom-variable-pitch-font'
;; + `doom-big-font' -- used for `doom-big-font-mode'; use this for
;;   presentations or streaming.
;;
;; They all accept either a font-spec, font string ("Input Mono-12"), or xlfd
;; font string. You generally only need these two:
;; (setq doom-font (font-spec :family "monospace" :size 12 :weight 'semi-light)
;;       doom-variable-pitch-font (font-spec :family "sans" :size 13))

;; There are two ways to load a theme. Both assume the theme is installed and
;; available. You can either set `doom-theme' or manually load a theme with the
;; `load-theme' function. This is the default:
;; (setq doom-theme 'doom-one)

;; If you use `org' and don't want your org files in the default location below,
;; change `org-directory'. It must be set before org loads!
;; (setq org-directory "~/org/")

;; This determines the style of line numbers in effect. If set to `nil', line
;; numbers are disabled. For relative line numbers, set this to `relative'.
;; (setq display-line-numbers-type t)

;; Here are some additional functions/macros that could help you configure Doom:
;;
;; - `load!' for loading external *.el files relative to this one
;; - `use-package!' for configuring packages
;; - `after!' for running code after a package has loaded
;; - `add-load-path!' for adding directories to the `load-path', relative to
;;   this file. Emacs searches the `load-path' when you load packages with
;;   `require' or `use-package'.
;; - `map!' for binding new keys
;;
;; To get information about any of these functions/macros, move the cursor over
;; the highlighted symbol at press 'K' (non-evil users must press 'C-c c k').
;; This will open documentation for it, including demos of how they are used.
;;
;; You can also try 'gd' (or 'C-c c d') to jump to their definition and see how
;; they are implemented.

#+end_src

* General Configuration

#+NAME: general-config
#+begin_src emacs-lisp :noweb yes
;;; General Configuration
;;;; Better Defaults
<<general-config-defaults>>

;;;; Windows
<<general-config-windows>>
#+end_src

** Better defaults

Doom Emacs already configure Emacs to have better defaults internally.
This is just a few more settings according to my preferences.

#+NAME: general-config-defaults
#+begin_src emacs-lisp
(setq-default delete-by-moving-to-trash t
              window-combination-resize t
              x-stretch-cursor t)

(setq undo-limit 80000000                          ; Raise undo-limit to 80 Mb
      evil-want-fine-undo t                        ; By default while in insert all changes are one big blob, be more granular
      auto-save-default t                          ; Nobody likes to loose work
      truncate-string-ellipsis "…"                ; Unicode ellispis are nicer than "...", and also save /precious/ space
      password-cache-expiry nil                    ; I can trust my computers ... can't I?
      scroll-preserve-screen-position 'always      ; Don't have `point' jump around
      scroll-margin 2                              ; It's nice to maintain a little margin
      display-time-default-load-average nil)       ; I don't think I've ever found this useful

(display-time-mode 1)                              ; Enable time in mode-line
(global-subword-mode 1)                            ; Iterate through CamelCase words



;; When working on a device with a battery, show the percentage.
(require 'battery)
(if (and battery-status-function
         (not (equal (alist-get ?L (funcall battery-status-function))
                     "N/A")))
    (prin1-to-string `(display-battery-mode 1))
  "")
#+end_src

*** Windows

When splitting the window, jump to the new window and ask for what buffer to show.

#+NAME: general-config-defaults
#+begin_src emacs-lisp
(setq evil-vsplit-window-right t
      evil-split-window-below t)

(defadvice! prompt-for-buffer (&rest _)
  :after '(evil-window-split evil-window-vsplit)
  (consult-buffer))
#+end_src

* Input
** Modules

#+NAME: input-modules
#+begin_src emacs-lisp
;;bidi              ; (tfel ot) thgir etirw uoy gnipleh
;;chinese
;;japanese
;;layout            ; auie,ctsrnm is the superior home row
#+end_src

** Packages

#+NAME: input-packages
#+begin_src emacs-lisp

#+end_src

** Configuration

#+NAME: input-config
#+begin_src emacs-lisp

#+end_src

* Completion
** Modules

#+NAME: completion-modules
#+begin_src emacs-lisp
;;company           ; the ultimate code completion backend
(corfu +orderless)  ; complete with cap(f), cape and a flying feather!
;;helm              ; the *other* search engine for love and life
;;ido               ; the other *other* search engine...
;;ivy               ; a search engine for love and life
vertico           ; the search engine of the future
#+end_src

** Packages

#+NAME: completion-packages
#+begin_src emacs-lisp

#+end_src

** Configuration

#+NAME: completion-config
#+begin_src emacs-lisp

#+end_src

* UI
