doom.org
*** Python

#+headers: :noweb-ref lang-config-python
#+begin_src emacs-lisp
;; Virtual environment
(defun shl-python-hook ()
  "Activate virtual environment and start LSP."
  (let* ((venv_path (concat (locate-dominating-file "." "pyproject.toml") ".venv/")))
    (with-eval-after-load 'pyvenv
      (pyvenv-activate venv_path))
    (with-eval-after-load 'lsp-mode
      (require 'lsp-pyright)
      (lsp))))

(use-package! python
  :config
  (setopt python-check-command "ruff")
  (add-hook 'python-mode-hook #'flymake-mode))

(use-package! pyvenv
  :hook (python-base-mode . shl-python-hook))

(use-package! lsp-pyright
  :custom (lsp-pyright-langserver-command "basedpyright"))

#+end_src

* Email
** Modules

#+NAME: email-modules
#+begin_src emacs-lisp
;;(mu4e +org +gmail)
;;notmuch
;;(wanderlust +gmail)
#+end_src

** Packages

#+NAME: email-packages
#+begin_src emacs-lisp

#+end_src

** Configuration

#+NAME: email-config
#+begin_src emacs-lisp

#+end_src

* App
** Modules

#+NAME: app-modules
#+begin_src emacs-lisp
;;calendar
;;emms
;;everywhere        ; *leave* Emacs!? You must be joking
;;irc               ; how neckbeards socialize
;;(rss +org)        ; emacs as an RSS reader
#+end_src

** Packages

#+NAME: app-packages
#+begin_src emacs-lisp

#+end_src

** Configuration

#+NAME: app-config
#+begin_src emacs-lisp

#+end_src

* Config
** Modules

#+NAME: config-modules
#+begin_src emacs-lisp
;;literate
(default +bindings +smartparens)
#+end_src

** Packages

#+NAME: config-packages
#+begin_src emacs-lisp

#+end_src

** Configuration

#+NAME: config-config
#+begin_src emacs-lisp :noweb yes

#+end_src

*** Which-key

#+NAME: config-config-which-key
#+begin_src emacs-lisp
(setq which-key-allow-multiple-replacements t)
(after! which-key
  (pushnew!
   which-key-replacement-alist
   '(("" . "\\`+?evil[-:]?\\(?:a-\\)?\\(.*\\)") . (nil . "◂\\1"))
   '(("\\`g s" . "\\`evilem--?motion-\\(.*\\)") . (nil . "◃\\1"))))
#+end_src
