config.el
;; Virtual environment
(defun shl-python-hook ()
  "Activate virtual environment and start LSP."
  (let* ((venv_path (concat (locate-dominating-file "." "pyproject.toml") ".venv/")))
    (with-eval-after-load 'pyvenv
      (pyvenv-activate venv_path))
    (with-eval-after-load 'lsp-mode
      (require 'lsp-pyright)
      (lsp))))

(use-package! python
  :config
  (setopt python-check-command "ruff")
  (add-hook 'python-mode-hook #'flymake-mode))

(use-package! pyvenv
  :hook (python-base-mode . shl-python-hook))

(use-package! lsp-pyright
  :custom (lsp-pyright-langserver-command "basedpyright"))



;;; Email Config


;;; App Config


;;; Config Config
